renesas/amazon-freertos/vendors/renesas/boards/rl78g14-fpb/ports/secure_sockets/aws_secure_sockets.c
//    if ('\0'==pvOptionValue)
//    {
//    	xTrustedFlags = pdFALSE;
//    }
//    else
//    {
//    	xTrustedFlags = pdTRUE;
//    }

    if( ( xSocket != SOCKETS_INVALID_SOCKET ) && ( xSocket != NULL ) )
    {
        switch( lOptionName )
        {
            case SOCKETS_SO_SERVER_NAME_INDICATION:
                /* Do not set the SNI options if the socket is possibly already connected. */
#if 0
            	if( pxContext->xConnectAttempted == pdTRUE )
                {
                    lStatus = SOCKETS_EISCONN;
                }
#endif

//                if( ULPGN_SOCKET_STATUS_CONNECTED == sx_ulpgn_get_tcp_socket_status((uint8_t)(pxContext->xSocket)) )
                if( ULPGN_SOCKET_STATUS_CONNECTED == R_WIFI_SX_ULPGN_GetTcpSocketStatus((uint8_t)(pxContext->xSocket)) )
                {
                    lStatus = SOCKETS_EISCONN;
                }
                else if(WIFI_SUCCESS != R_WIFI_SX_ULPGN_RequestTlsSocket(pxContext->socket_number))
                {
                    lStatus = SOCKETS_ENOPROTOOPT;
                }
                /* Non-NULL destination string indicates that SNI extension should
                 * be used during TLS negotiation. */
                else if( NULL == ( pxContext->pcDestination =
                                       ( char * ) pvPortMalloc( 1U + xOptionLength ) ) )
                {
                    lStatus = SOCKETS_ENOMEM;
                }
                else
                {
                	memcpy(&tmp_chr,pvOptionValue, xOptionLength);
                    memcpy( pxContext->pcDestination, pvOptionValue, xOptionLength );
                    pxContext->pcDestination[ xOptionLength ] = '\0';
                }

                break;

            case SOCKETS_SO_TRUSTED_SERVER_CERTIFICATE:
                /* Do not set the trusted server certificate if the socket is possibly already connected. */
                if( pxContext->xConnectAttempted == pdTRUE )
                {
                    lStatus = SOCKETS_EISCONN;
                }
                else if(WIFI_SUCCESS != R_WIFI_SX_ULPGN_RequestTlsSocket(pxContext->socket_number))
                {
                    lStatus = SOCKETS_ENOPROTOOPT;
                }
//                /* Non-NULL server certificate field indicates that the default trust
//                 * list should not be used. */
//                else if( NULL == ( pxContext->pcServerCertificate =
//                                  ( char * ) pvPortMalloc( xOptionLength ) ) )
//                {
//                    lStatus = SOCKETS_ENOMEM;
//                }
                else
                {
#if 0
                	R_WIFI_SX_ULPGN_EraseServerCertificate (0);
                    if( WIFI_SUCCESS != R_WIFI_SX_ULPGN_SocketOptSetTrustRootCertificate (
                         pxContext->socket_number, pvOptionValue, xOptionLength -1))
                    {
                        lStatus = SOCKETS_ENOMEM;
                    }
                    else
                    {

                    }
#endif
#if 0
                    memcpy( pxContext->pcServerCertificate, pvOptionValue, xOptionLength );
                    pxContext->ulServerCertificateLength = xOptionLength;
#endif
                }
                break;

            case SOCKETS_SO_REQUIRE_TLS:
                /* Do not set the TLS option if the socket is possibly already connected. */
                if( pxContext->xConnectAttempted == pdTRUE )
                {
                    lStatus = SOCKETS_EISCONN;
                }
//                else if(WIFI_SUCCESS != R_WIFI_SX_ULPGN_RequestTlsSocket(pxContext->socket_number,pxContext->ussl_cert_id,pdFALSE))
				else if(WIFI_SUCCESS != R_WIFI_SX_ULPGN_RequestTlsSocket(pxContext->socket_number))
                {
                    lStatus = SOCKETS_ENOPROTOOPT;
                }
                else
                {
                    pxContext->xRequireTLS = pdTRUE;
                }
                break;

            case SOCKETS_SO_ALPN_PROTOCOLS:

                /* Do not set the ALPN option if the socket is already connected. */
                if( pxContext->xConnectAttempted == pdTRUE )
                {
                    lStatus = SOCKETS_EISCONN;
                    break;
                }

                /* Allocate a sufficiently long array of pointers. */
                pxContext->ulAlpnProtocolsCount = 1 + xOptionLength;

                if( NULL == ( pxContext->ppcAlpnProtocols =
                                  ( char ** ) pvPortMalloc( pxContext->ulAlpnProtocolsCount * sizeof( char * ) ) ) )
                {
                    lStatus = SOCKETS_ENOMEM;
                }
                else
                {
                    /* Zero out the pointers. */
                    memset( pxContext->ppcAlpnProtocols,
                            0,
                            pxContext->ulAlpnProtocolsCount * sizeof( char * ) );
                }

                /* Copy each protocol string. */
                for( ulProtocol = 0;
                     ( ulProtocol < pxContext->ulAlpnProtocolsCount - 1 ) &&
                     ( pdFREERTOS_ERRNO_NONE == lStatus );
                     ulProtocol++ )
                {
                    xLength = strlen( ppcAlpnIn[ ulProtocol ] );

                    if( NULL == ( pxContext->ppcAlpnProtocols[ ulProtocol ] =
                                      ( char * ) pvPortMalloc( 1 + xLength ) ) )
                    {
                        lStatus = SOCKETS_ENOMEM;
                    }
                    else
                    {
                        memcpy( pxContext->ppcAlpnProtocols[ ulProtocol ],
                                ppcAlpnIn[ ulProtocol ],
                                xLength );
                        pxContext->ppcAlpnProtocols[ ulProtocol ][ xLength ] = '\0';
                    }
                }

                break;

            case SOCKETS_SO_NONBLOCK:
                /* Non-blocking connect is not supported.  Socket may be set to nonblocking
                 * only after a connection is made. */
                if( pdTRUE == pxContext->xConnectAttempted )
                {
					pxContext->ulSendTimeout = 1000;
					pxContext->ulRecvTimeout = 2;
                }
                else
                {
                    lStatus = SOCKETS_EISCONN;
                }
                break;

            case SOCKETS_SO_RCVTIMEO:
                /* Comply with Berkeley standard - a 0 timeout is wait forever. */
                xTimeout = *( ( const TickType_t * ) pvOptionValue ); /*lint !e9087 pvOptionValue passed should be of TickType_t */

                if( xTimeout == 0U )
                {
                    xTimeout = portMAX_DELAY;
                }
                pxContext->ulRecvTimeout = xTimeout;
                break;
            case SOCKETS_SO_SNDTIMEO:
                /* Comply with Berkeley standard - a 0 timeout is wait forever. */
                xTimeout = *( ( const TickType_t * ) pvOptionValue ); /*lint !e9087 pvOptionValue passed should be of TickType_t */

                if( xTimeout == 0U )
                {
                    xTimeout = portMAX_DELAY;
                }
                pxContext->ulSendTimeout = xTimeout;
                break;

            default:
                lStatus = SOCKETS_ENOPROTOOPT;
                break;
        }
    }
    else
    {
        lStatus = SOCKETS_EINVAL;
    }

    return lStatus;
}
/*-----------------------------------------------------------*/

/**
 * @brief Resolve a host name using Domain Name Service.
 *
 * @param[in] pcHostName The host name to resolve.
 * @return
 * * The IPv4 address of the specified host.
 * * If an error has occured, 0 is returned.
 */
uint32_t SOCKETS_GetHostByName( const char * pcHostName )
{
	uint32_t ulAddr = 0;
	uint32_t ret;

	ret = R_WIFI_SX_ULPGN_DnsQuery((uint8_t *)pcHostName, &ulAddr);
	if(0 == ret)
	{
		ulAddr = SOCKETS_htonl( ulAddr );
	}
	return ulAddr;
}
/*-----------------------------------------------------------*/

/**
 * @brief Secure Sockets library initialization function.
 *
 * This function does general initialization and setup. It must be called once
 * and only once before calling any other function.
 *
 * @return
 * * @ref pdPASS if everything succeeds
 * * @ref pdFAIL otherwise.
 */
BaseType_t SOCKETS_Init( void )
{
    /* FIX ME. */
    BaseType_t xResult = pdFAIL;

    /* Create the global mutex which is used to ensure
     * that only one socket is accessing the ucInUse bits in
     * the socket array. */
	xUcInUse = xSemaphoreCreateMutex();
	if (xUcInUse == NULL)
	{
		return pdFAIL;
	}
	xResult = pdPASS;
    /* Success. */

    return xResult;
}
/*-----------------------------------------------------------*/

